[
  {
    "title": "What is the programmatic means by which subjects are held accountable for their actions while authenticated on a system?",
    "content": "Monitoring.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "Besides accountability, what is another primary purpose of monitoring?",
    "content": "To detect unauthorized or abnormal activities on a system.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "The tools used to extract relevant, significant, or important details from large collections of log data are known as _____ tools.",
    "content": "data mining",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What specific type of data mining tool is required for true automation and real-time analysis of security events?",
    "content": "An intrusion detection system (IDS).",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is the term for the record of system events created by logging, which can be used to recreate a step-by-step history of an event?",
    "content": "An audit trail.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is the primary function of an Intrusion Detection System (IDS)?",
    "content": "To automate the inspection of audit logs and real-time system events to detect intrusion attempts.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "An IDS is considered what form of security control?",
    "content": "A technical detective security control.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "An IDS response that directly affects malicious activity, such as by blocking traffic, is known as a(n) _____ response.",
    "content": "active",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What type of IDS response involves recording information and notifying an administrator but does not affect the malicious activity itself?",
    "content": "A passive response.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "How does an Intrusion Prevention System (IPS) differ from an Intrusion Detection System (IDS)?",
    "content": "An IPS is a preventive and proactive technology that actively blocks attacks, whereas an IDS is a detective and after-the-fact technology.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "According to the source material, what should be the first response when an intrusion is detected?",
    "content": "To contain the intrusion to prevent additional damage to other systems.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is a host-based IDS (HIDS)?",
    "content": "An IDS that watches for questionable activity on a single computer system.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is a network-based IDS (NIDS)?",
    "content": "An IDS that watches for questionable activity being performed over the network medium by capturing and evaluating packets.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is a major advantage of a host-based IDS over a network-based IDS in terms of analysis?",
    "content": "It can examine events in much greater detail and pinpoint the specific files and processes that were compromised.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is a key disadvantage of a host-based IDS regarding its visibility to an attacker?",
    "content": "Attackers can discover the IDS software on the monitored computer and may disable or manipulate it.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What performance issue is associated with host-based IDSs?",
    "content": "They consume resources from the computer being monitored, reducing the performance of that system.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "Why are host-based IDSs generally considered more costly to manage than network-based IDSs?",
    "content": "They require installation and administrative attention on each individual server being monitored.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is a primary advantage of a network-based IDS regarding its deployment?",
    "content": "A single network-based IDS can monitor a large network if installed on a backbone where most traffic occurs.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "How can a network-based IDS be made invisible to intruders on the network?",
    "content": "By operating in stealth mode, where it doesn't have a visible network address.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is a significant limitation of a network-based IDS concerning data privacy?",
    "content": "It is unable to examine the contents of encrypted traffic.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "The IDS detection method that uses a signature database to match monitored events against known attack patterns is called _____ detection.",
    "content": "knowledge-based (or signature-based)",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is the primary drawback of a knowledge-based IDS?",
    "content": "It is effective only against known attack methods and cannot recognize new or modified attacks.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "The IDS detection method that first learns the normal activities of a system and then detects abnormal events is known as _____ detection.",
    "content": "behavior-based (or anomaly detection)",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is a major advantage of a behavior-based IDS?",
    "content": "It can detect unforeseen, new, and unknown vulnerabilities, attacks, and intrusion methods.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is the primary drawback of a behavior-based IDS?",
    "content": "It produces many false alarms because normal user and system activity can vary widely.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is a honey pot in the context of network security?",
    "content": "A computer or entire network created as a snare to attract and keep an intruder logged on for monitoring and evidence gathering.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is a padded cell system?",
    "content": "A system where a detected intruder is automatically transferred to a simulated environment to be monitored without their knowledge.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is the function of a vulnerability scanner?",
    "content": "To test a system for known security vulnerabilities and weaknesses and generate reports for remediation.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is penetration testing?",
    "content": "A vigorous attempt to break into a protected network using any means necessary to test the strength of security measures.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is a crucial prerequisite before performing penetration testing on an organization's network?",
    "content": "It should only be performed with the consent and knowledge of management.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is a brute-force attack?",
    "content": "An attempt to discover a password by systematically trying every possible combination of letters, numbers, and symbols.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is a dictionary attack?",
    "content": "An attempt to discover a password by using a predefined list of common or expected passwords.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "How do password cracking tools work against systems that store hashed passwords?",
    "content": "They use reverse hash matching, finding a possible password that generates the same hash value as the one stored.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "A security measure that prevents attackers from repeatedly trying passwords at a logon prompt is called _____.",
    "content": "account lockout control",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is a denial-of-service (DoS) attack?",
    "content": "An attack that prevents a system from processing or responding to legitimate traffic or requests for resources.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is a distributed denial-of-service (DDoS) attack?",
    "content": "A DoS attack where the attacker compromises several systems (zombies or slaves) and uses them as launching platforms against a victim.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "A _____ attack takes advantage of Internet services like DNS by sending requests with a spoofed source address of the victim, causing the servers to flood the victim with responses.",
    "content": "distributed reflective denial of service (DRDoS)",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "How does a SYN flood attack work?",
    "content": "It sends numerous SYN packets to a server but never replies with the final ACK, causing the server to hold open many half-open connections and exhaust its resources.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is a smurf attack?",
    "content": "An attack where ping requests with the victim's spoofed IP address are sent to a network's broadcast address, causing all nodes to send responses to the victim.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is a ping-of-death attack?",
    "content": "A DoS attack that employs an oversized ping packet, which can cause the recipient system to freeze, crash, or reboot when it tries to process it.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "A _____ attack occurs when fragmented packets are sent with overlapping offset fields, causing the target system to crash upon reassembly.",
    "content": "teardrop",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is a land attack?",
    "content": "A DoS attack where the attacker sends a SYN packet spoofed to have the same source and destination IP address and port number as the victim, causing it to freeze or crash.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is a botnet?",
    "content": "A coordinated network of compromised machines used to attack other systems, distribute spam, or disseminate phishing lures.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "The operator of a botnet is commonly called a _____.",
    "content": "bot herder",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is a spoofing attack?",
    "content": "An attack that consists of replacing the valid source and/or destination IP address with a false one to hide the attacker's identity.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is a man-in-the-middle attack?",
    "content": "An attack where a malicious user is able to gain a position between two endpoints of a communication, allowing them to intercept, read, or alter traffic.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "A _____ attack is an offshoot of a man-in-the-middle attack where the malicious user interrupts an existing session and takes it over.",
    "content": "hijack",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is a replay attack?",
    "content": "An attack where a malicious user records traffic (like an authentication session) and then retransmits it later to impersonate the original client and gain access.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is a sniffer attack?",
    "content": "An activity, often using a packet-capturing program, that results in a malicious user obtaining information about a network or the traffic over that network.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "Why is spamming considered a type of denial-of-service attack?",
    "content": "It can fill up storage space, consume significant bandwidth and CPU resources, and prevent legitimate messages from being delivered.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "In the context of the source text, what is the definition of a 'cracker'?",
    "content": "A malicious user intent on waging an attack against a person or system, possibly motivated by greed, power, or recognition.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is the definition of a 'hacker' according to the source text?",
    "content": "A technology enthusiast with no malicious intent.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is an access control compensation measure?",
    "content": "A measure that is not a direct prevention of a problem but provides resiliency for quick recovery, such as backups.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is cited as the best means to compensate against access control violations that result in data loss or corruption?",
    "content": "Reliable backups and a mechanism to restore data.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What technology can provide fault tolerance against device failure or severe access violations related to disk drives?",
    "content": "RAID (Redundant Array of Independent Disks).",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  },
  {
    "title": "What is the primary goal of deploying fault-tolerant systems like mirrored servers or clustered systems?",
    "content": "To ensure that the loss of a single system or device does not lead to the failure of the entire network environment.",
    "category": "Information Security",
    "language": "English",
    "tags": [
      "Security",
      "CISSP"
    ]
  }
]